Revit 2026 API

# PlasticvinylApplicationType Enumeration

---

The enumerated type representing the permitted values for the asset property "PlasticvinylApplication" from the "PlasticVinyl" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PlasticvinylApplicationType
```
```vb
Public Enumeration PlasticvinylApplicationType
```
```cpp
public enum class PlasticvinylApplicationType
```
```fsharp
type PlasticvinylApplicationType
```

| Member name | Value | Description |
| --- | --- | --- |
| Glossy | 1 |  |
| Matte | 2 |  |
| Polished | 0 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace